In [1]:
import numpy as np
import pandas as pd

EDA 데이터셋을 본격적으로 Numpy, Pandas로 분석하기 전에 과제를 통해 손을 푼다고 생각하고 연습해보시면 좋을 것 같습니다!

# 1. Numpy

In [5]:
# Q1.10~30까지의 정수를 담은 array를 만들어보세요. 이를 a1이라는 변수로 저장하세요
a1 = np.arange(10,31)
print(a1)

[10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30]

In [6]:
# Q2. 위에서 만든 array는 shape이 21*1입니다. a1의 shape을 7*3로 바꿔보세요
a1.reshape(7,3)

array([[10, 11, 12],
       [13, 14, 15],
       [16, 17, 18],
       [19, 20, 21],
       [22, 23, 24],
       [25, 26, 27],
       [28, 29, 30]])

In [9]:
# Q3. a1의 array에 있는 값들의 평균과 최댓값을 구해보세요. 세션에서 명확하게 다루지는 않았지만 쉽게 생각해내실 수 있습니다. 모르시면 구글을 활용하세요
print(a1.mean())
print(a1.max())

20.0
30

In [16]:
# Q4. 이제는 다차원 배열을 만들어보겠습니다 
# 4*4의 shape을 가지는 다차원 배열을 생성해보세요. 안의 값들은 1부터 채워넣으시면 됩니다. 이를 arr1이라는 변수에 저장하세요
arr1 = np.arange(1,17).reshape(4,4)
print(arr1)

[[ 1  2  3  4]
 [ 5  6  7  8]
 [ 9 10 11 12]
 [13 14 15 16]]

In [18]:
# Q5. arr1에서 2,6,10,14만 추출하는 코드를 작성해보세요
arr1[arr1%4==2]

array([ 2,  6, 10, 14])

In [22]:
#Q6. arr1에서 7, 8, 11, 12를 추출하는 코드를 작성해보세요
arr1[1:3, 2:4]

array([[ 7,  8],
       [11, 12]])

In [23]:
#Q7. arr1에서 7,15를 추출하는 코드를 작성해보세요
arr1[[1,3],2]

array([ 7, 15])

In [25]:
#Q8. 아래에 있는 arr2를 arr1 아래에다가 붙여서 arr3을 만들어보세요
arr2 = np.array([[17,18,19,20],[21,22,23,24]])

arr3 = np.append(arr1, arr2, axis=0)
arr3

array([[ 1,  2,  3,  4],
       [ 5,  6,  7,  8],
       [ 9, 10, 11, 12],
       [13, 14, 15, 16],
       [17, 18, 19, 20],
       [21, 22, 23, 24]])

In [26]:
# Q9. arr3에서 15이상인 값들만 추출하는 코드를 작성해보세요
arr3[arr3>=15]

array([15, 16, 17, 18, 19, 20, 21, 22, 23, 24])

In [28]:
# Q10. 1*10의 array를 값이 랜덤이 되게 만들고 그 중에서 최댓값을 0으로 바꿔보세요
# 세션에서 명확하게 다루지 않은 내용입니다. 슬랙에 질문하거나 구글을 활용하시면 좋을 것 같습니다

arr4 = np.random.random((1,10))* -1
arr4

array([[-0.67819972, -0.45038194, -0.75994371, -0.54799138, -0.25795126,
        -0.45740609, -0.82883847, -0.4837091 , -0.37015953, -0.81478941]])

In [27]:
arr4 = np.random.random((1,10))
arr4

array([[0.65518695, 0.42641175, 0.79750931, 0.6973188 , 0.94541061,
        0.74226097, 0.00285086, 0.09466566, 0.54450783, 0.02282145]])

# Pandas

In [36]:
# 준비
# 먼저 타이타닉 데이터셋을 구글 드라이브 마운트 혹은 파일을 경로를 알기 쉬운 곳에 가져와주세요
pd.read_csv(r"C:\Users\SHIN Soyeon\Desktop\[0105] Numpy & Pandas\Titanic.csv")

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [40]:
# Q11. Titanic 파일을 불러와 titanic_df라는 변수에 저장하고(저장할 때 첫 번째 열은 index로 지정) 위에서 2개의 행만 출력해보세요
titanic_df = pd.read_csv(r"C:\Users\SHIN Soyeon\Desktop\[0105] Numpy & Pandas\Titanic.csv", index_col=0)
titanic_df.head(2)

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S

In [49]:
# Q12. 먼저 결측치를 처리해보겠습니다. 결측치가 하나라도 있는 행은 제거하는 코드를 작성해보세요
# EDA 프로젝트 때는 결측치를 다른 값으로 채우거나 없애는 작업을 할 수 있지만 여기서는 없애고 진행하겠습니다

titanic_df.isnull().sum()
titanic_df = titanic_df.dropna(axis=0)
titanic_df

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
904,1,"Snyder, Mrs. John Pillsbury (Nelle Stevenson)",female,23.0,1,0,21228,82.2667,B45,S
906,1,"Chaffee, Mrs. Herbert Fuller (Carrie Constance...",female,47.0,1,0,W.E.P. 5734,61.1750,E31,S
916,1,"Ryerson, Mrs. Arthur Larned (Emily Maria Borie)",female,48.0,1,3,PC 17608,262.3750,B57 B59 B63 B66,C
918,1,"Ostby, Miss. Helene Ragnhild",female,22.0,0,1,113509,61.9792,B36,C
920,1,"Brady, Mr. John Bertram",male,41.0,0,0,113054,30.5000,A21,S
...,...,...,...,...,...,...,...,...,...,...
1296,1,"Frauenthal, Mr. Isaac Gerald",male,43.0,1,0,17765,27.7208,D40,C
1297,2,"Nourney, Mr. Alfred (Baron von Drachstedt"")""",male,20.0,0,0,SC/PARIS 2166,13.8625,D38,C
1299,1,"Widener, Mr. George Dunton",male,50.0,1,1,113503,211.5000,C80,C
1303,1,"Minahan, Mrs. William Edward (Lillian E Thorpe)",female,37.0,1,0,19928,90.0000,C78,Q
1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C

In [55]:
# Q13. titanic_df에서 가장 어린 승객의 이름과 나이를 구할 수 있는 코드를 작성해보세요
# 답은 여러 개가 있을 수 있습니다. 

titanic_df.sort_values(by='Age')[["Name", "Age"]]

                                                          Name   Age
PassengerId
1009                           Sandstrom, Miss. Beatrice Irene   1.0
1088                           Spedden, Master. Robert Douglas   6.0
1218                              Becker, Miss. Ruth Elizabeth  12.0
956                                Ryerson, Master. John Borie  13.0
1287            Smith, Mrs. Lucien Philip (Mary Eloise Hughes)  18.0
...                                                        ...   ...
1197         Crosby, Mrs. Edward Gifford (Catherine Elizabe...  64.0
1071         Compton, Mrs. Alexander Taylor (Mary Eliza Ing...  64.0
1128                                  Warren, Mr. Frank Manley  64.0
973                                         Straus, Mr. Isidor  67.0
988          Cavendish, Mrs. Tyrell William (Julia Florence...  76.0

[87 rows x 2 columns]

In [56]:
# Q14. Fare 값이 가장 높은 값과 낮은 값의 차이를 구하는 코드를 작성해보세요
# 답은 여러 개가 있을 수 있습니다. 

print('가장 비싼 티켓과 가장 싼 티켓의 가격 차이: $', titanic_df['Fare'].max()-titanic_df['Fare'].min())

가장 비싼 티켓과 가장 싼 티켓의 가격 차이: $ 512.3292

In [64]:
# Q15. Fare 값 상위 5명의 평균 가격을 계산하는 코드를 작성해보세요
titanic_df["Fare"].sort_values(ascending=False)[:5].mean()

312.61584000000005

In [ ]:
# Q16. 타이타닉 승객 중 여성이면서 나이가 40세 이상인 고객들의 정보를 추출하는 코드를 작성해보세요
# 힌트 : 2개의 조건을 동시에 만족할 수 있게 인덱싱하려면 &를 활용하시는 것도 하나의 방법입니다
titanic_df[(titanic_df['Age'] >=40) & (titanic_df['Sex'] == 'female')]

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
906,1,"Chaffee, Mrs. Herbert Fuller (Carrie Constance...",female,47.0,1,0,W.E.P. 5734,61.1750,E31,S
916,1,"Ryerson, Mrs. Arthur Larned (Emily Maria Borie)",female,48.0,1,3,PC 17608,262.3750,B57 B59 B63 B66,C
936,1,"Kimball, Mrs. Edwin Nelson Jr (Gertrude Parsons)",female,45.0,1,0,11753,52.5542,D19,S
940,1,"Bucknell, Mrs. William Robert (Emma Eliza Ward)",female,60.0,0,0,11813,76.2917,D15,C
961,1,"Fortune, Mrs. Mark (Mary McDougald)",female,60.0,1,4,19950,263.0000,C23 C25 C27,S
969,1,"Cornell, Mrs. Robert Clifford (Malvina Helen L...",female,55.0,2,0,11770,25.7000,C101,S
988,1,"Cavendish, Mrs. Tyrell William (Julia Florence...",female,76.0,1,0,19877,78.8500,C46,S
992,1,"Stengel, Mrs. Charles Emil Henry (Annie May Mo...",female,43.0,1,0,11778,55.4417,C116,C
1006,1,"Straus, Mrs. Isidor (Rosalie Ida Blun)",female,63.0,1,0,PC 17483,221.7792,C55 C57,S
1071,1,"Compton, Mrs. Alexander Taylor (Mary Eliza Ing...",female,64.0,0,2,PC 17756,83.1583,E45,C
1110,1,"Widener, Mrs. George Dunton (Eleanor Elkins)",female,50.0,1,1,113503,211.5000,C80,C
1131,1,"Douglas, Mrs. Walter Donald (Mahala Dutton)",female,48.0,1,0,PC 17761,106.4250,C86,C
1197,1,"Crosby, Mrs. Edward Gifford (Catherine Elizabe...",female,64.0,1,1,112901,26.5500,B26,S
1206,1,"White, Mrs. John Stuart (Ella Holmes)",female,55.0,0,0,PC 17760,135.6333,C32,C
1235,1,"Cardeza, Mrs. James Warburton Martinez (Charlo...",female,58.0,0,1,PC 17755,512.3292,B51 B53 B55,C
1242,1,"Greenfield, Mrs. Leo David (Blanche Strouse)",female,45.0,0,1,PC 17759,63.3583,D10 D12,C
1248,1,"Brown, Mrs. John Murray (Caroline Lane Lamson)",female,59.0,2,0,11769,51.4792,C101,S
1266,1,"Dodge, Mrs. Washington (Ruth Vidaver)",female,54.0,1,1,33638,81.8583,A34,S
1283,1,"Lines, Mrs. Ernest H (Elizabeth Lindsey James)",female,51.0,0,1,PC 17592,39.4000,D28,S
1289,1,"Frolicher-Stehli, Mrs. Maxmillian (Margaretha ...",female,48.0,1,1,13567,79.2000,B41,C

In [77]:
# Q17.타이타닉 승객들을 Embarked와 성별을 기준으로 그룹화하고, 각 그룹 별로 평균 나이를 출력해보세요
group_df = titanic_df.groupby(['Embarked','Sex'])
group_df[['Age']].mean()

                       Age
Embarked Sex
C        female  40.318182
         male    39.080000
Q        female  37.000000
S        female  38.952381
         male    38.638889

In [79]:
# Q18. 이제는 3개의 데이터프레임을 병합해보겠습니다
# 먼저 아래 3개의 데이터프레임을 생성하는 코드를 만들어보세요
# 주문 정보 ord_df

ord_df = pd.DataFrame([[100, 11, 9001], [100, 12, 9002], [200, 13, 9001], [200, 14, 9003], [300, 15, 9003]],
                      index=[0,1,2,3,4],
                      columns=['CUST_ID', 'ORD_NO', 'PRDT_CD'])
ord_df

   CUST_ID  ORD_NO  PRDT_CD
0      100      11     9001
1      100      12     9002
2      200      13     9001
3      200      14     9003
4      300      15     9003

In [82]:
# 고객 정보 cust_df
cust_df = pd.DataFrame([[100, 'kim'], [200, 'park'], [300, 'ahn'], [400, 'choi']],
                      index = [0,1,2,3],
                      columns = ['CUST_ID', 'NAME'])
cust_df

   CUST_ID  NAME
0      100   kim
1      200  park
2      300   ahn
3      400  choi

In [85]:
# 상품정보 prdt_df

prdt_df = pd.DataFrame([[9001,'Notebook', 1000000], [9002, 'TABLET', 1500000], [9003, 'TV', 2000000]],
                      index = [0,1,2],
                      columns = ['PRDT_CD', 'NM', 'PRICE'])
prdt_df

   PRDT_CD        NM    PRICE
0     9001  Notebook  1000000
1     9002    TABLET  1500000
2     9003        TV  2000000

In [136]:
# Q19. ord_df와 cust_df를 병합하여 아래와 같은 결과가 나오게 코드를 작성해보세요. ord_cust_df라는 변수로 저장하세요

ord_cust_df = pd.merge(ord_df, cust_df,
                      how = 'left')
ord_cust_df

   CUST_ID  ORD_NO  PRDT_CD  NAME
0      100      11     9001   kim
1      100      12     9002   kim
2      200      13     9001  park
3      200      14     9003  park
4      300      15     9003   ahn

In [134]:
# Q20. 19번에서 만든 데이터프레임과 prdt_df를 병합하여 아래와 같은 결과가 나오게 코드를 작성해보세요. merge_df라는 변수로 저장하세요

merge_df = ord_cust_df.set_index('PRDT_CD').join(prdt_df.set_index('PRDT_CD'))
#merge_df = pd.merge(ord_cust_df, prdt_df, how = 'left')
merge_df

         CUST_ID  ORD_NO  NAME        NM    PRICE
PRDT_CD
9001         100      11   kim  Notebook  1000000
9001         200      13  park  Notebook  1000000
9002         100      12   kim    TABLET  1500000
9003         200      14  park        TV  2000000
9003         300      15   ahn        TV  2000000

In [121]:
#Q21. 20번에서 만든 데이터셋으로 각 고객이 총 얼마를 지불하였는지 보여주는 코드를 작성해보세요

merge_group = merge_df.groupby(['NAME'])
merge_group['PRICE'].sum()

NAME
ahn     2000000
kim     2500000
park    3000000
Name: PRICE, dtype: int64

수고하셨습니다!